{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > TRAVEL: Task-oriented Agents", "content": "Today I'm going to focus on task oriented agents. There are two types of such agents. First one is just based on slot based tasks. And then we'll go into knowledge and task based agents. How do we evaluate Gini agents or like any conversation agents?", "block_metadata": {"start (ms)": 51525, "end (ms)": 357315}}
{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > Customer Service Agents: User Initiative vs Mixed-Initiative Agents", "content": "OpenAI's customer service bot itself uses a dialogue tree instead of letting the user give natural language response. Mixed initiative agents are very different and they follow an unhappy path at any point of time. Despite the LLM success, the question is why do commercial chatbots like to be conservative?", "block_metadata": {"start (ms)": 357775, "end (ms)": 728785}}
{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > Neural Agent Policies vs Dialogue Tree-based Agents", "content": "There are two types of agent policies that you can choose from. One is a neural policy and the other one is a programmed agent policy. The third one is using GENIE worksheet. We are increasing the level of abstraction as we go from the dialogue tree based policies to worksheets.", "block_metadata": {"start (ms)": 730285, "end (ms)": 1090705}}
{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > Trello and Multi-Action Based Agents", "content": "These are finite state machine agents using dialogue acts. Multi Wars was one of the biggest data set for task oriented agents. But still there are several errors in this dataset.", "block_metadata": {"start (ms)": 1091725, "end (ms)": 1516505}}
{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > Neural network for dialogue state tracking", "content": "Each utterance that a user has, it should be contextualized. What should we give the context to the agent for this user utterance? Would it be the current location? Let's look at why state machine based agents do not well.", "block_metadata": {"start (ms)": 1517925, "end (ms)": 2000953}}
{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > Better Agents: Gini Worksheets and", "content": "Gini worksheets should be fully mixed initiative agent. It provides a high level declarative specification. Developer only needs to define all the happy parts. There is a runtime system that can handle all the unhappy parts.", "block_metadata": {"start (ms)": 2001049, "end (ms)": 2117549}}
{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > Genie Worksheets: The Agent Framework", "content": "The key concept of Gini worksheets is that user initiatives are always given priority. The developer should be able to define different kind of policies. The agent should be responsive to the user and support all knowledge queries. All these can be defined using the developer controllability.", "block_metadata": {"start (ms)": 2117637, "end (ms)": 2675215}}
{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > Gini Worksheets", "content": "Gini worksheets track user utterances, tasks and knowledge queries. We have five agents acts in this in GENIE worksheet which are report, confirm, say propose and ask. And it uses LLM for doing semantic parsing and generating response.", "block_metadata": {"start (ms)": 2676635, "end (ms)": 3331065}}
{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > GENIE 3.8: The Agent Policy", "content": "We don't let the LLM generate the response directly by looking at the user's utterance or the response from getting information from a database. Instead, we use the GENIE runtime system to compute the agent response. Using symbolic like agent policy and a runtime system instead of just having an ALM decide the policy.", "block_metadata": {"start (ms)": 3331725, "end (ms)": 3900235}}
{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > How can we evaluate Gini Agents?", "content": "How we evaluate Gini worksheets is using real users. We evaluated on three domains and the three domains that we evaluated were Bank Trivia and Trip. Most of the errors were due to the agent not following the agent policy that was described. And again there are annotation problems.", "block_metadata": {"start (ms)": 3902495, "end (ms)": 4492195}}
{"document_title": "CS224V Lecture 15", "section_title": "CS224V Lecture 15 > Chapter Summaries > Five tips for building responsive agents in LLM", "content": " LLMs need succinct to represent context and fewer instructions to make them perform better in lesser known domains. The existing academic data set, at least for task oriented agents, are not enough for evaluation. You need to evaluate them with real users.", "block_metadata": {"start (ms)": 4494255, "end (ms)": 4782605}}
