{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > Oh My!", "content": "Make all words react. Genie, red and blue. It's good. Okay, perfect. Yeah.", "block_metadata": {"start (ms)": 257845, "end (ms)": 303015}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > Guest Lecture", "content": "Jackie Young is a PhD but dissertation, haven't submitted my dissertation yet. My thesis is about multimodal AI augmented user interface development architecture. I will talk about two of my work which I think will be very relevant to you folks when you're building virtual assistant stuff.", "block_metadata": {"start (ms)": 303055, "end (ms)": 404155}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > Mixed-Media Interactions", "content": "Currently it's slow for applying actions to multiple objects. For less common features such as all of the stuff in those text boxes, you have to go through multiple clicks. The most important issue is development cost. If you want to implement multimodal interaction, you must tackle all of them.", "block_metadata": {"start (ms)": 406055, "end (ms)": 936523}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > React Genie in Natural Language Programming (NLPR)", "content": " React Genie is a new programming language for natural language programming. We ask LLMs to translate what the user wants into a bunch of actions using method training. All of the examples I've shown before are actually real, so here's a demo for that.", "block_metadata": {"start (ms)": 936639, "end (ms)": 1454585}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > React Genie: The Intelligence of the User", "content": "React Genie tries to solve two problems. One is the ease of development by heavily relying on annotations on top of existing React code. The second part is I want to have very rich multimodal functionality. I want user to be able to say a very complex command and show the result accordingly.", "block_metadata": {"start (ms)": 1455205, "end (ms)": 1847795}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > React Genie 2.8: The Semantic parser and", "content": "The semantic parser and the response generator of React genie. How do you prompt LLM to generate the thing on the right? Give you like potential options like functions. Some potential situations where information ratio will be super crucial.", "block_metadata": {"start (ms)": 1848975, "end (ms)": 2125495}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > UI Mapping and Scripting", "content": "Next up is UI mapping. If specific objects specific value in the state is being updated, then your UI automatically reflects that changes. We tested React Genie extensively for developers. Is it easy to learn and easy to test? We built some demo apps.", "block_metadata": {"start (ms)": 2126035, "end (ms)": 2645845}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > React 2.8: Not Enough Features for Multimod", "content": "Next project is called Genie wizard, which is how to address this not enough feature problem about multimodal interactions. The way we simulate user commands is like hallucination of LLMs. It tells developers what are the functions they need to implement.", "block_metadata": {"start (ms)": 2648145, "end (ms)": 2903291}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > How to Build a Human-Like App with LLM", "content": "We simulate what user might want to do with the app with LLM. From that we generate interactive dialogue. We figure out what are the functions that are missing in those hallucinations. From those commands we generate actual functions developers need to implement.", "block_metadata": {"start (ms)": 2903403, "end (ms)": 3268101}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > Systems research in the New Age of AI", "content": "A lot of the stuff in this course is kind of about using systems research for those AI HCI problems. In this new age of AI you can truly use those AI to build better human systems. So I think this could elude into a new way of building new computer systems projects.", "block_metadata": {"start (ms)": 3268133, "end (ms)": 3432805}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > Mixed-Modality Machine Learning", "content": "The same thing can work with both voice and images. In some sense, the multimodal models convert other modalities into tokens. Can you map Uber to a specific token? I think it's going to be hard.", "block_metadata": {"start (ms)": 3436185, "end (ms)": 3850395}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > React Genie: Multisodal Interaction", "content": "React Genie aims to foster multimodal interaction adoption. It merges modern app features with multimodals interfaces for flexibility and easy development. If you want to make it into industry, do you want consider like multi human universities?", "block_metadata": {"start (ms)": 3851775, "end (ms)": 4135125}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > DeepMind on Voice Interfaces", "content": "Voice interfaces are sometimes inaccurate, especially in noisy environments. Another problem is voice is very interesting because when you start talking randomly in public, people look at you. Could you just skip voice and go straight to neuralink?", "block_metadata": {"start (ms)": 4142735, "end (ms)": 4308247}}
{"document_title": "CS224V Lecture 16", "section_title": "CS224V Lecture 16 > Chapter Summaries > Chemical Science Lecture", "content": "Cool. I guess that's it for this lecture. Thanks a lot for being here. It.", "block_metadata": {"start (ms)": 4308391, "end (ms)": 5002535}}
